{"backend": "tensorflow", "keras_version": "2.1.5", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"activity_regularizer": null, "strides": [2, 2], "kernel_constraint": null, "bias_regularizer": null, "batch_input_shape": [null, 4, 4, 1], "padding": "valid", "dtype": "float32", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_constraint": null, "activation": "relu", "filters": 2, "kernel_size": [2, 2], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "pool1", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "activation": "softmax", "bias_constraint": null, "units": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null}}]}